nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_beacon_device.c
/******************************************************************************

 @file  mac_beacon_device.c

 @brief Implements device only procedures for beacon enabled networks.

 Group: WCS, LPC
 Target Device: cc13xx_cc26xx

 ******************************************************************************
 
 Copyright (c) 2006-2021, Texas Instruments Incorporated
 All rights reserved.

 IMPORTANT: Your use of this Software is limited to those specific rights
 granted under the terms of a software license agreement between the user
 who downloaded the software, his/her employer (which must be your employer)
 and Texas Instruments Incorporated (the "License"). You may not use this
 Software unless you agree to abide by the terms of the License. The License
 limits your use, and you acknowledge, that the Software may not be modified,
 copied or distributed unless embedded on a Texas Instruments microcontroller
 or used solely and exclusively in conjunction with a Texas Instruments radio
 frequency transceiver, which is integrated into your product. Other than for
 the foregoing purpose, you may not use, reproduce, copy, prepare derivative
 works of, modify, distribute, perform, display or sell this Software and/or
 its documentation for any purpose.

 YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
 PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
 INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
 NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
 TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
 NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
 LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
 INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
 OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
 OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
 (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

 Should you have any questions regarding your right to use this Software,
 contact Texas Instruments Incorporated at www.TI.com.

 ******************************************************************************
 
 
 *****************************************************************************/

/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */

#ifndef LIBRARY
#include "ti_wisunfan_features.h"
#endif

#include "hal_mcu.h"
#include "timac_api.h"
#include "mac_main.h"
#include "mac_pib.h"
#include "mac_timer.h"
#include "mac_mgmt.h"
#include "mac_low_level.h"
#include "mac_radio.h"
#include "mac_data.h"
#include "mac_device.h"
#include "mac_beacon.h"
#include "mac_spec.h"
#include "mac_beacon_device.h"
#include "mac_symbol_timer.h"
#include "mac_hl_patch.h"

// SW Tracer
#include "dbg.h"
#ifdef DEBUG_SW_TRACE
#define DBG_ENABLE
#ifndef _DBGFILE
#define _DBGFILE mac_beacon_device_c
#endif
#include "dbgid_sys_mst.h"
#endif // DEBUG_SW_TRACE

#include "rom_jt_154.h"

/* ------------------------------------------------------------------------------------------------
 *                                           Constants
 * ------------------------------------------------------------------------------------------------
 */
#define MAC_BEACON_TRACK_TIME(X) (MAC_BEACON_INTERVAL(pMacPib->beaconOrder) + \
                                  MAC_A_BASE_SUPERFRAME_DURATION + (X))

#if defined (FEATURE_BEACON_MODE) || defined (FEATURE_NON_BEACON_MODE)
/* ------------------------------------------------------------------------------------------------
 *                                           Typedefs
 * ------------------------------------------------------------------------------------------------
 */


/* ------------------------------------------------------------------------------------------------
 *                                           Local Variables
 * ------------------------------------------------------------------------------------------------
 */


/* ------------------------------------------------------------------------------------------------
 *                                           Local Functions
 * ------------------------------------------------------------------------------------------------
 */

void macBroadcastPendCallback(uint8 param);
void macBeaconStopTrack(void);
void macIncomingNonSlottedTx(void);
void macBeaconSyncLoss(void);
void macSyncTimeoutCallback(uint8 param);

#if !defined(TIMAC_ROM_PATCH)
void macTrackTimeoutCallback(uint8 param);
void macTrackStartCallback(uint8 param);
#endif

void macTrackPeriodCallback(uint8 param);
void macRxBeaconCritical(macRx_t *pBuf);
uint8 macCheckPendAddr(uint8 pendAddrSpec, uint8 *pAddrList);

/**************************************************************************************************
 * @fn          macBroadcastPendCallback
 *
 * @brief       This function is called when the broadcast pending timer expires.  It turns off
 *              the receiver.
 *
 * input parameters
 *
 * @param       param - not used.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macBroadcastPendCallback(uint8 param)
{
  (void)param;  // Intentionally unreferenced parameter

  MAP_macRxDisable(MAC_RX_BROADCAST_PEND);
}

/**************************************************************************************************
 * @fn          macBeaconStopTrack
 *
 * @brief       This function stops beacon tracking.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macBeaconStopTrack(void)
{
  DBG_PRINT0(DBGSYS, "Beacon Device: macBeaconStopTrack()");

  /* stop beacon tracking */
  if (pMacPib->rxOnWhenIdle)
  {
    MAP_macRxSoftEnable(MAC_RX_WHEN_IDLE);
  }
  MAP_macRxDisable(MAC_RX_BEACON_DEVICE);
  MAP_macTimerCancel(&macBeaconDevice.timeoutTimer);
  MAP_macTimerCancel(&macBeaconDevice.trackTimer);

  MAP_macSymbolTimerInit();

