nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_beacon_device.c
}
/**************************************************************************************************
 * @fn          macIncomingNonSlottedTx
 *
 * @brief       Set up all frames scheduled for the incoming superframe for nonslotted tx.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macIncomingNonSlottedTx(void)
{
  macTx_t       *pCurr;
  halIntState_t intState;

  DBG_PRINT0(DBGSYS, "Beacon Device: macIncomingNonSlottedTx()");

  HAL_ENTER_CRITICAL_SECTION(intState);

  /* iterate over tx queue */
  pCurr = MAP_OSAL_MSG_Q_HEAD(&macData.txQueue);
  while (pCurr != NULL)
  {
    /* set frame to be *both* incoming and outgoing CAP; this will allow transmission in
     * outgoing CAP when sync is lost or in incoming CAP if we sync again before the
     * frame is transmitted
     */
    if (pCurr->internal.txSched & MAC_TX_SCHED_INCOMING_CAP)
    {
      pCurr->internal.txSched |= MAC_TX_SCHED_OUTGOING_CAP;
      pCurr->internal.txMode &= ~MAC_TX_MODE_SLOTTED;
    }
    pCurr = MAP_OSAL_MSG_NEXT(pCurr);
  }

  HAL_EXIT_CRITICAL_SECTION(intState);

  MAP_macSetEvent(MAC_TX_COMPLETE_TASK_EVT);
}

/**************************************************************************************************
 * @fn          macBeaconSyncLoss
 *
 * @brief       Handle sync loss.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macBeaconSyncLoss(void)
{
  macMlmeSyncLossInd_t syncLossInd;

  DBG_PRINT0(DBGSYS, "Beacon Device: macBeaconSyncLoss()");

  /* if cluster tree network is no longer started */
  macMgmt.networkStarted = FALSE;

  /* initialize beacon state and schedule */
  macBeacon.state = MAC_BEACON_NONE_ST;
  macBeacon.sched = MAC_TX_SCHED_OUTGOING_CAP;
  macBeacon.rxWindow = FALSE;

  /* set up any queued data for non-slotted tx */
  MAP_macIncomingNonSlottedTx();

  /* if cluster tree need to start timer for indirect data expiration */
  MAP_macSetEvent(MAC_EXP_INDIRECT_TASK_EVT);

  /* if interally generated sync */
  if (macBeacon.txSync)
  {
    macBeacon.txSync = FALSE;
  }
  /* else send sync loss ind */
  else
  {
    syncLossInd.hdr.event = MAC_MLME_SYNC_LOSS_IND;
    syncLossInd.hdr.status = MAC_BEACON_LOSS;
    syncLossInd.panId = pMacPib->panId;
    syncLossInd.logicalChannel = pMacPib->logicalChannel;
    syncLossInd.phyID = pMacPib->curPhyID;
    syncLossInd.channelPage = pMacPib->channelPage;
    syncLossInd.sec.securityLevel = MAC_SEC_LEVEL_NONE;
    MAP_MAC_CbackEvent((macCbackEvent_t *) &syncLossInd);
  }
}

/**************************************************************************************************
 * @fn          macSyncTimeoutCallback
 *
 * @brief       This function is called if the beacon is not found in the alloted window
 *              during a beacon search initiated by a sync request.
 *
 * input parameters
 *
 * @param       param - not used.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macSyncTimeoutCallback(uint8 param)
{
#ifdef COMBO_MAC
    uint8 rfFreq = pMacPib->rfFreq;
#endif

  (void)param;  // Intentionally unreferenced parameter

  DBG_PRINT1(DBGSYS, "Beacon Device: macSyncTimeoutCallback(rxWindow=%i)", macBeacon.rxWindow);

  /* if rxWindow is FALSE then sync was postponed because a tx was in progress; if tx is no
   * longer in progress turn on the receiver and let sync proceed
   */
  if (macBeacon.rxWindow == FALSE)
  {
    if (pMacDataTx == NULL)
    {
      macBeacon.rxWindow = TRUE;
      MAP_macRxEnable(MAC_RX_BEACON_DEVICE);
    }
#ifdef COMBO_MAC
   if (rfFreq == MAC_RF_FREQ_SUBG)
   {
       MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_PROCESS_DELAY));
   }
   else
   {
       MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_IEEE_PROCESS_DELAY));
   }
#else
#ifndef FREQ_2_4G
    MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_PROCESS_DELAY));
#else
    MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_IEEE_PROCESS_DELAY));
#endif
#endif
  }
  else
  {
    macBeaconDevice.lostCount++;

    if (macBeaconDevice.lostCount == MAC_A_MAX_LOST_BEACONS)
    {
      MAP_macRxDisable(MAC_RX_BEACON_DEVICE);
      MAP_macBeaconSyncLoss();
    }
    else
    {
#ifdef COMBO_MAC
      if (rfFreq == MAC_RF_FREQ_SUBG)
      {
          MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_PROCESS_DELAY));
      }
      else
      {
          MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_IEEE_PROCESS_DELAY));
      }
#else
#ifndef FREQ_2_4G
      MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_PROCESS_DELAY));
#else
      MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_IEEE_PROCESS_DELAY));
#endif
#endif
    }
  }
}


#if !defined(TIMAC_ROM_PATCH)
/**************************************************************************************************
 * @fn          macTrackTimeoutCallback
 *
 * @brief       This function is called if the beacon is not found in the alloted window
 *              during beacon tracking.
 *
 * input parameters
 *
 * @param       param - not used.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macTrackTimeoutCallback(uint8 param)
{
  uint8 marginBeaconOrder = pMacPib->beaconOrder;
  (void)param;  // Intentionally unreferenced parameter

  macBeacon.rxWindow = FALSE;
  macBeaconDevice.lostCount++;

  DBG_PRINT1(DBGSYS, "Beacon Device: macTrackTimeoutCallback(lostCount=%i)", macBeaconDevice.lostCount);

  if (macBeaconDevice.lostCount == MAC_A_MAX_LOST_BEACONS)
  {
    MAP_macBeaconStopTrack();
    MAP_macBeaconSyncLoss();
  }
  else
  {
    MAP_macRxDisable(MAC_RX_BEACON_DEVICE);

    /* added to allow end-nodes, that are synced to larger than
     * network beacon-orders, to sync to the next beacon (after one is missed)
     * if the device beacon order is in effect.
     */
    if ((pMacPib->deviceBeaconOrder != MAC_BO_NON_BEACON) &&
        (macBeacon.coordBeaconOrder < pMacPib->beaconOrder))
    {
      /* use the larger margin window value of the device beacon order */
      marginBeaconOrder = pMacPib->deviceBeaconOrder;

      /* set the beacon order back to the coordinator beacon order */
      pMacPib->beaconOrder = macBeacon.coordBeaconOrder;

