nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_beacon_device.c
      /* the MAC timer rollover must be set too */
      MAP_macTimerSetRollover(pMacPib->beaconOrder);
    }

    /* increase the beacon tracking window by the beacon margin */
    MAP_macTimerAligned(&macBeaconDevice.trackTimer,
                    MAC_BEACON_INTERVAL(pMacPib->beaconOrder) -
                    (macBeaconMargin[marginBeaconOrder] * (macBeaconDevice.lostCount + 1)));
  }
}

/**************************************************************************************************
 * @fn          macTrackStartCallback
 *
 * @brief       This callback is executed when beacon tracking begins for the next beacon
 *              interval.
 *
 * input parameters
 *
 * @param       param - not used.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macTrackStartCallback(uint8 param)
{
#ifdef COMBO_MAC
    uint8 rfFreq = pMacPib->rfFreq;
#endif

  (void)param;  // Intentionally unreferenced parameter

  DBG_PRINT0(DBGSYS, "Beacon Device: macTrackStartCallback()");

  macBeacon.rxWindow = TRUE;

  if (pMacPib->beaconOrder == MAC_BO_NON_BEACON)
  {
    /* stop beacon tracking */
    MAP_macBeaconStopTrack();
  }
  else
  {
    /* Netwrok is started after beacon tracking */
    macMgmt.networkStarted = TRUE;

    MAP_macRxEnable(MAC_RX_BEACON_DEVICE);
    macBeaconDevice.timeoutTimer.pFunc = macTrackTimeoutCallback;
#ifdef COMBO_MAC
    if (rfFreq == MAC_RF_FREQ_SUBG)
    {
        MAP_macTimerAligned(&macBeaconDevice.timeoutTimer, MAC_BEACON_TO_MULTIPLE *
                        macBeaconMargin[pMacPib->beaconOrder] * (macBeaconDevice.lostCount + 1) +
                        MAC_PROCESS_DELAY);
    }
    else
    {
        MAP_macTimerAligned(&macBeaconDevice.timeoutTimer, MAC_BEACON_TO_MULTIPLE *
                        macBeaconMargin[pMacPib->beaconOrder] * (macBeaconDevice.lostCount + 1) +
                        MAC_IEEE_PROCESS_DELAY);
    }
#else
#ifndef FREQ_2_4G
    MAP_macTimerAligned(&macBeaconDevice.timeoutTimer, MAC_BEACON_TO_MULTIPLE *
                    macBeaconMargin[pMacPib->beaconOrder] * (macBeaconDevice.lostCount + 1) +
                    MAC_PROCESS_DELAY);
#else
    MAP_macTimerAligned(&macBeaconDevice.timeoutTimer, MAC_BEACON_TO_MULTIPLE *
                    macBeaconMargin[pMacPib->beaconOrder] * (macBeaconDevice.lostCount + 1) +
                    MAC_IEEE_PROCESS_DELAY);
#endif
#endif
  }
}
#endif

/**************************************************************************************************
 * @fn          macTrackPeriodCallback
 *
 * @brief       This callback is executed at end of the CAP.
 *
 * input parameters
 *
 * @param       param - not used.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
#if !defined (TIMAC_ROM_PATCH)
void macTrackPeriodCallback(uint8 param)
{
  ApiMac_mlmeSyncReq_t syncReq;

  (void)param;  // Intentionally unreferenced parameter

  DBG_PRINT0(DBGSYS, "Beacon Device: macTrackPeriodCallback()");

  macBeacon.sched = MAC_TX_SCHED_INACTIVE;

  /* if only did a sync for one beacon */
  if (macBeacon.state == MAC_BEACON_SYNC_ST)
  {
    /* end of superframe */
    macBeacon.state = MAC_BEACON_NONE_ST;

    /* if data is queued initiate internal sync req */
    if (macData.directCount != 0)
    {
      syncReq.logicalChannel = pMacPib->logicalChannel;
      syncReq.channelPage = pMacPib->channelPage;
      syncReq.phyID = pMacPib->curPhyID;
      syncReq.trackBeacon = MAC_TRACK_BEACON_TX_SYNC;
      MAP_MAC_MlmeSyncReq(&syncReq);
    }
  }
  /* else disable rx if there is an inactive period */
  else if (pMacPib->superframeOrder != pMacPib->beaconOrder)
  {
    MAP_macRxHardDisable();
    /* Power down the radio */
    macSymbolTimerPowerDown();
  }
}

/**************************************************************************************************

 * @fn          macRxBeaconCritical
 *
 * @brief       Performs timing-critical procedures for the received beacons.
 *
 * input parameters
 *
 * @param       pBuf - received beacon.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macRxBeaconCritical(macRx_t *pBuf)
{
  uint16 sfs;

  DBG_PRINT1(DBGSYS, "Beacon Device: macRxBeaconCritical(rxWindow=%i)", macBeacon.rxWindow);

  if (macBeacon.rxWindow && (pBuf->mac.srcPanId == pMacPib->panId) &&
      MAP_macCoordAddrCmp(&pBuf->mac.srcAddr))
  {
    macBeacon.rxWindow = FALSE;

    /* disable receiver for tracking or polling, but keep it on if rxOnWhenIdle */
    if (pMacPib->rxOnWhenIdle)
    {
      MAP_macRxSoftEnable(MAC_RX_WHEN_IDLE);
    }
    if (macDevice.dataReqMask != 0)
    {
      MAP_macRxSoftEnable(MAC_RX_POLL);
    }

    /* handle pending broadcast from coordinator */
    if (pBuf->internal.flags & MAC_RX_FLAG_PENDING)
    {
      MAP_macRxSoftEnable(MAC_RX_BROADCAST_PEND);
      MAP_macSetEvent(MAC_BROADCAST_PEND_TASK_EVT);
    }

    MAP_macRxDisable(MAC_RX_BEACON_DEVICE);

    /* cancel the timeout timer */
    MAP_macTimerCancel(&macBeaconDevice.timeoutTimer);

    /* this beacon is from our coordinator, record the beacon info from superframe spec */
    sfs = BUILD_UINT16(pBuf->msdu.p[MAC_SFS_OFFSET], pBuf->msdu.p[MAC_SFS_OFFSET+1]);
    macBeacon.finalCapSlot = MAC_SFS_FINAL_CAP_SLOT(sfs);
    macBeacon.battLifeExt = MAC_SFS_BLE(sfs);
    macBeacon.coordBeaconOrder = MAC_SFS_BEACON_ORDER(sfs);
    pMacPib->superframeOrder = MAC_SFS_SUPERFRAME_ORDER(sfs);

    /* if device beacon order is being used and the received
     * coordinator beacon order is less than the device beacon order and
     * there is no pending data
     *
     * byte pBuf->msdu.p[MAC_PENDING_ADDR_OFFSET] contains the pending address field of
     * the beacon frame (If there are no pending frames it will equal zero).
     * note: check of pending data assumes GTS is not in use
     */
    if ((pMacPib->deviceBeaconOrder != MAC_BO_NON_BEACON) &&
        (macBeacon.coordBeaconOrder < pMacPib->deviceBeaconOrder) &&
        (pBuf->msdu.p[MAC_PENDING_ADDR_OFFSET] == 0))
    {
      /* set the beacon order to the device beacon order */
      pMacPib->beaconOrder = pMacPib->deviceBeaconOrder;
    }
    else
    {
      /* set the beacon order to the received beacon order */
      pMacPib->beaconOrder = macBeacon.coordBeaconOrder;
    }

    /* Clear the lost count */
    macBeaconDevice.lostCount = 0;

    if (pMacPib->beaconOrder != MAC_BO_NON_BEACON)
    {
      /* setup for next beacon track */
      MAP_macTimerRealign(pBuf, pMacPib->beaconOrder);

      if (macBeacon.state == MAC_BEACON_TRACKING_ST)
      {
        MAP_macTimerCancel(&macBeaconDevice.trackTimer);
        MAP_macTimerAligned(&macBeaconDevice.trackTimer,
          MAC_BEACON_INTERVAL(pMacPib->beaconOrder) - macBeaconMargin[pMacPib->beaconOrder]);
      }

      MAP_macBeaconSetupCap(MAC_TX_SCHED_INCOMING_CAP, pMacPib->superframeOrder, pBuf->msdu.len);

      MAP_macTimerCancel(&macBeacon.periodTimer);
      macBeacon.periodTimer.pFunc = MAP_macTrackPeriodCallback;
      MAP_macTimerAligned(&macBeacon.periodTimer, macBeacon.capEnd);

      MAP_macSetEvent(MAC_TX_COMPLETE_TASK_EVT);
    }
    else
    {
      if (macBeacon.state == MAC_BEACON_TRACKING_ST)
      {
        /* stop tracking */
        MAP_macBeaconStopTrack();
        MAP_macBeaconSyncLoss();
      }
    }
  }
}
#endif
/**************************************************************************************************
 * @fn          MAC_InitBeaconDevice
 *
 * @brief       Initializes the MAC to operate as a device in a beacon enabled network.
 *
 * input parameters
 *
 * None.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void MAC_InitBeaconDevice(void)
{
  /* Initialize beacon device action tables */
  macBeaconDeviceAction[0] = MAP_macApiSyncReq;
  macBeaconDeviceAction[1] = MAP_macAutoPoll;
  macBeaconDeviceAction[2] = MAP_macBeaconStartFrameResponseTimer;
  macBeaconDeviceAction[3] = MAP_macStartBroadcastPendTimer;

  /* setup timer callbacks */
  macBeaconDevice.trackTimer.pFunc = MAP_macTrackStartCallback;
  macBeaconDevice.timeoutTimer.pFunc = MAP_macTrackTimeoutCallback;
  macBeaconDevice.broacastPendTimer.pFunc = MAP_macBroadcastPendCallback;

  /* setup beacon pointer to functions */
  macDataRxBeaconCritical = MAP_macRxBeaconCritical;

