nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_beacon_device.c
  /* set up action table */
  macActionSet[MAC_BEACON_DEVICE_ACTION] = macBeaconDeviceAction;

  MAP_macBeaconInit();

  macMain.featureMask |= MAC_FEAT_BEACON_DEVICE_MASK;
}

/**************************************************************************************************
 * @fn          macCheckPendAddr
 *
 * @brief       Checks the pending address field of the received beacon to see if it matches
 *              the device's address.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      The address mode if match found, otherwise SADDR_MODE_NONE.
 **************************************************************************************************
 */
uint8 macCheckPendAddr(uint8 pendAddrSpec, uint8 *pAddrList)
{
  uint8 numShort = MAC_PEND_NUM_SHORT(pendAddrSpec);
  uint8 numExt = MAC_PEND_NUM_EXT(pendAddrSpec);

  /* check if a short addr in the list matches ours  */
  while (numShort-- > 0)
  {
    if (pMacPib->shortAddress == BUILD_UINT16(pAddrList[0], pAddrList[1]))
    {
      return SADDR_MODE_SHORT;
    }
    pAddrList += MAC_SHORT_ADDR_FIELD_LEN;
  }

  /* check if an extended addr in the list matches ours  */
  while (numExt-- > 0)
  {
    if (MAP_sAddrExtCmp(pMacPib->extendedAddress.addr.extAddr, pAddrList))
    {
      return SADDR_MODE_EXT;
    }
    pAddrList += MAC_EXT_ADDR_FIELD_LEN;
  }

  return SADDR_MODE_NONE;
}

#if !defined (TIMAC_ROM_PATCH)
/**************************************************************************************************
 * @fn          macAutoPoll
 *
 * @brief       This action function is executed to send an automatic poll request.  Variable
 *              dataReqMask is set to indicate that the poll request is generated internally.
 *              Then it builds and sends a data request command frame.  In addition, some handling
 *              of the end-of-CAP period timer is done here.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macAutoPoll(macEvent_t *pEvent)
{
  uint8         srcAddrMode = SADDR_MODE_NONE;
  sAddr_t       coordAddr;
  halIntState_t intState;

  if ((macDevice.dataReqMask == 0) && pMacPib->autoRequest)
  {
    srcAddrMode = MAP_macCheckPendAddr(pEvent->beaconNotify.info.beaconData.pendAddrSpec,
                                   pEvent->beaconNotify.info.beaconData.pAddrList);
    if (srcAddrMode != SADDR_MODE_NONE)
    {
      macDevice.dataReqMask |= MAC_DATA_REQ_AUTO;

      /* our address is in the beacon, setup for data poll */
      MAP_macGetCoordAddress(&coordAddr);

      MAP_macRxSoftEnable(MAC_RX_POLL);

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
      /* prepare auto poll secutiry settings */
      MAP_MAC_MlmeGetSecurityReq(MAC_AUTO_REQUEST_KEY_SOURCE, &macDevice.sec.keySource);
      MAP_MAC_MlmeGetSecurityReq(MAC_AUTO_REQUEST_SECURITY_LEVEL, &macDevice.sec.securityLevel);
      MAP_MAC_MlmeGetSecurityReq(MAC_AUTO_REQUEST_KEY_ID_MODE, &macDevice.sec.keyIdMode);
      MAP_MAC_MlmeGetSecurityReq(MAC_AUTO_REQUEST_KEY_INDEX, &macDevice.sec.keyIndex);
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#endif /* FEATURE_MAC_SECURITY */

      MAP_macBuildCommonReq(MAC_INTERNAL_DATA_REQ, srcAddrMode,
                        &coordAddr, pMacPib->panId, MAC_TXOPTION_ACK, &macDevice.sec);
    }
  }

  /* determine whether the period timer should be cancelled; first check variables
   * that do not require a critical section
   */
  if ((srcAddrMode == SADDR_MODE_NONE) &&                 /* not doing an auto-poll right now */
      (pMacPib->beaconOrder != MAC_BO_NON_BEACON) &&        /* configured as beacon-enabled */
      (pMacPib->beaconOrder != pMacPib->superframeOrder) &&   /* there is an inactive period */
      !pMacPib->rxOnWhenIdle &&                             /* receiver not always on */
      MAP_macStateIdle())                                 /* state machine in idle state */
  {
    /* Make sure RAT is active before calling macTimerCancel() within the critical section */
      /*REDUNDANT - To be removed */
    MAC_PWR_VOTE_NO_SWI(TRUE);

    /* check variables which require a critical section */
    HAL_ENTER_CRITICAL_SECTION(intState);
    if ((macBeacon.state == MAC_BEACON_TRACKING_ST) &&    /* beacon is being tracked */
        (macBeacon.sched != MAC_TX_SCHED_INACTIVE) &&     /* not already in inactive period */
        (pMacDataTx == NULL) &&                           /* no transmission in progress */
        MAP_OSAL_MSG_Q_EMPTY(&macData.txQueue))               /* no queued tx data */
    {
      HAL_EXIT_CRITICAL_SECTION(intState);
      /* MAC is not active, so force the end of CAP early; this way the device can enter
       * low power mode without the period timer unnecessarily waking it up.
       * Keep interrupts disabled to protect against timer expiring before it is cancelled.
       */
      MAP_macTimerCancel(&macBeacon.periodTimer);
      MAP_macTrackPeriodCallback(0);
    }
    else
    {
      HAL_EXIT_CRITICAL_SECTION(intState);
    }
  }
}
#endif
/**************************************************************************************************
 * @fn          macApiSyncReq
 *
 * @brief       This function handles the API for sync request.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macApiSyncReq(macEvent_t *pEvent)
{
  bool          txSync = FALSE;
  uint8         state;
  halIntState_t intState;
  uint8         status = MAC_SUCCESS;
#ifdef COMBO_MAC
  uint8 rfFreq = pMacPib->rfFreq;
#endif

#if (MAC_CHAN_LOWEST == 0)
  /* No need to check MAC_CHAN_LOWEST if it is zero */
  MAC_PARAM_STATUS((pEvent->api.mac.syncReq.logicalChannel <= MAC_CHAN_HIGHEST), status);
#else
  MAC_PARAM_STATUS((pEvent->api.mac.syncReq.logicalChannel >= MAC_CHAN_LOWEST) &&
                   (pEvent->api.mac.syncReq.logicalChannel <= MAC_CHAN_HIGHEST), status);
#endif

#ifdef COMBO_MAC
  if (rfFreq == MAC_RF_FREQ_SUBG)
  {
      /* verify channel page */
      MAC_PARAM_STATUS((pEvent->api.mac.syncReq.channelPage >= MAC_CHANNEL_PAGE_9) &&
                       (pEvent->api.mac.syncReq.channelPage <= MAC_CHANNEL_PAGE_10), status);

      /* verify phy ID */
      MAC_PARAM_STATUS(((pEvent->api.mac.syncReq.phyID >= MAC_MRFSK_STD_PHY_ID_BEGIN) &&
                       (pEvent->api.mac.syncReq.phyID <= MAC_MRFSK_STD_PHY_ID_END)) ||
                       ((pEvent->api.mac.syncReq.phyID >= MAC_MRFSK_GENERIC_PHY_ID_BEGIN) &&
                       (pEvent->api.mac.syncReq.phyID <= MAC_MRFSK_GENERIC_PHY_ID_END)), status);
  }
#else
#ifndef FREQ_2_4G
  /* verify channel page */
  MAC_PARAM_STATUS((pEvent->api.mac.syncReq.channelPage >= MAC_CHANNEL_PAGE_9) &&
                   (pEvent->api.mac.syncReq.channelPage <= MAC_CHANNEL_PAGE_10), status);

  /* verify phy ID */
  MAC_PARAM_STATUS(((pEvent->api.mac.syncReq.phyID >= MAC_MRFSK_STD_PHY_ID_BEGIN) &&
                   (pEvent->api.mac.syncReq.phyID <= MAC_MRFSK_STD_PHY_ID_END)) ||
                   ((pEvent->api.mac.syncReq.phyID >= MAC_MRFSK_GENERIC_PHY_ID_BEGIN) &&
                   (pEvent->api.mac.syncReq.phyID <= MAC_MRFSK_GENERIC_PHY_ID_END)), status);
#endif
#endif

  if ((status == MAC_SUCCESS) &&
      (pMacPib->beaconOrder != MAC_BO_NON_BEACON) &&
      (pMacPib->panId != MAC_PAN_ID_BROADCAST) &&
      (pMacPib->coordShortAddress != MAC_SHORT_ADDR_NONE))
  {
    /* if application enabled beacon tracking */
    if (pEvent->api.mac.syncReq.trackBeacon == TRUE)
    {
      state = MAC_BEACON_TRACKING_ST;
    }
    /* if application disabled beacon tracking */
    else if (pEvent->api.mac.syncReq.trackBeacon == FALSE)
    {
      state = MAC_BEACON_SYNC_ST;
    }
    /* if this is an internally generated sync (note trackBeacon has non-boolean value) */
    else if ((pEvent->api.mac.syncReq.trackBeacon == MAC_TRACK_BEACON_TX_SYNC) &&
             (macBeacon.state == MAC_BEACON_NONE_ST))
    {
      state = MAC_BEACON_SYNC_ST;
      txSync = TRUE;
    }
    else
    {
      return;
    }

    /* stop beacon tracking and superframe timers */
    MAP_macTimerCancel(&macBeaconDevice.timeoutTimer);
    MAP_macTimerCancel(&macBeaconDevice.trackTimer);
    MAP_macTimerCancel(&macBeacon.periodTimer);

    /* initialize global variables */
    HAL_ENTER_CRITICAL_SECTION(intState);
    macBeacon.state = state;
    macBeacon.capEnd = 0;
    macBeacon.sched = MAC_TX_SCHED_INACTIVE;

    /* it is possible to for a sync to occur when a transmit is in progress; if this
     * happens we hold off sync by setting rxWindow to FALSE and keep the receiver off,
     * then enable things later from macSyncTimeoutCallback
     */
    if (pMacDataTx == NULL)
    {
      macBeacon.rxWindow = TRUE;
    }
    else
    {
      macBeacon.rxWindow = FALSE;
      DBG_PRINT0(DBGSYS, "!!! Sync occurred while transmit in progress.");
    }

    macBeacon.txSync = txSync;
    if (txSync)
    {
      macBeaconDevice.lostCount = MAC_A_MAX_LOST_BEACONS - 1;
    }
    else
    {
      macBeaconDevice.lostCount = 0;
    }
    HAL_EXIT_CRITICAL_SECTION(intState);

