nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_beacon_device.c
    /* initiate beacon search */
    MAP_MAC_MlmeSetReq(MAC_PHY_CURRENT_DESCRIPTOR_ID, &pEvent->api.mac.syncReq.phyID);
    MAP_MAC_MlmeSetReq(MAC_CHANNEL_PAGE, &pEvent->api.mac.syncReq.channelPage);
    MAP_MAC_MlmeSetReq(MAC_LOGICAL_CHANNEL, &pEvent->api.mac.syncReq.logicalChannel);

    /* if rxWindow is FALSE we're holding off sync because a tx is in progress */
    if (macBeacon.rxWindow == TRUE)
    {
      MAP_macRxEnable(MAC_RX_BEACON_DEVICE);
    }

    macBeaconDevice.timeoutTimer.pFunc = MAP_macSyncTimeoutCallback;
#ifdef COMBO_MAC
    if (rfFreq == MAC_RF_FREQ_SUBG)
    {
        MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_PROCESS_DELAY));
    }
    else
    {
        MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_IEEE_PROCESS_DELAY));
    }
#else
#ifndef FREQ_2_4G
    MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_PROCESS_DELAY));
#else
    MAP_macTimer(&macBeaconDevice.timeoutTimer, MAC_BEACON_TRACK_TIME(MAC_IEEE_PROCESS_DELAY));
#endif
#endif
  }
}

/**************************************************************************************************
 * @fn          macBeaconStartFrameResponseTimer
 *
 * @brief       This function starts the frame response timer.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macBeaconStartFrameResponseTimer(macEvent_t *pEvent)
{
  uint32 timeout = pMacPib->maxFrameTotalWaitTime;

  (void)pEvent;  // Intentionally unreferenced parameter

  if (pMacPib->beaconOrder != MAC_BO_NON_BEACON)
  {
    /* If not enough time for frame response before CAP end, set timer to expire
     * in the next beacon interval.
     */
    if ((MAP_macTimerGetTime() + timeout) >= macBeacon.capEnd)
    {
      timeout = timeout + MAC_BEACON_INTERVAL(pMacPib->beaconOrder) +
                MAC_A_BASE_SUPERFRAME_DURATION - macBeacon.capEnd;
    }
  }

  DBG_PRINT1(DBGSYS, "Beacon Device: macBeaconStartFrameResponseTimer(timeout=%i)", timeout);

  MAP_macTimerCancel(&macDevice.frameTimer);
  MAP_macTimer(&macDevice.frameTimer, timeout);
}

/**************************************************************************************************
 * @fn          macStartBroadcastPendTimer
 *
 * @brief       This function starts the broadcast pending timer.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macStartBroadcastPendTimer(macEvent_t *pEvent)
{
  (void)pEvent;  // Intentionally unreferenced parameter

  DBG_PRINT0(DBGSYS, "Beacon Device: macStartBroadcastPendTimer()");

  if (pMacPib->beaconOrder != MAC_BO_NON_BEACON)
  {
    /* if superframe order is zero, don't set timer; let end of superframe turn off rx */
    if (pMacPib->superframeOrder > 0)
    {
      MAP_macTimerCancel(&macBeaconDevice.broacastPendTimer);
      MAP_macTimer(&macBeaconDevice.broacastPendTimer,
               (uint32) pMacPib->maxFrameTotalWaitTime);
    }
  }
  /* beacon order is non-beacon; don't need to receive broadcast, just turn off rx */
  else
  {
    MAP_macRxDisable(MAC_RX_BROADCAST_PEND);
  }
}

#endif

